[command]/home/runner/work/_temp/0f4ad79e-f8fd-4f0a-a530-a7d62966cb58/terraform-bin plan -no-color
module.storage_bucket.google_storage_bucket.my_bucket: Refreshing state... [id=testing-cicdanu-prod2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.my_bucket will be created
  + resource "google_storage_bucket" "my_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "testing-cicdanu-prod"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: module.storage_bucket.google_storage_bucket.my_bucket: Refreshing state... [id=testing-cicdanu-prod2]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_storage_bucket.my_bucket will be created%0A  + resource "google_storage_bucket" "my_bucket" {%0A      + effective_labels            = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + force_destroy               = false%0A      + id                          = (known after apply)%0A      + location                    = "EU"%0A      + name                        = "testing-cicdanu-prod"%0A      + project                     = (known after apply)%0A      + project_number              = (known after apply)%0A      + public_access_prevention    = (known after apply)%0A      + rpo                         = (known after apply)%0A      + self_link                   = (known after apply)%0A      + storage_class               = "STANDARD"%0A      + terraform_labels            = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + uniform_bucket_level_access = (known after apply)%0A      + url                         = (known after apply)%0A%0A      + soft_delete_policy (known after apply)%0A%0A      + versioning {%0A          + enabled = true%0A        }%0A%0A      + website (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

<!-- Sticky Pull Request Comment -->